<net name="default" version="2" batch="1">
    <layers>
        <layer name="input" type="Input" precision="FP32" id="0">
            <output>
                <port id="0">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>184</dim>
                    <dim>184</dim>
                </port>
            </output>
        </layer>
        <layer name="conv1_1" type="Convolution" precision="FP32" id="1">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="64" group="1"/>
            <input>
                <port id="1">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>184</dim>
                    <dim>184</dim>
                </port>
            </input>
            <output>
                <port id="2">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>184</dim>
                    <dim>184</dim>
                </port>
            </output>
            <weights offset="0" size="6912"/>
            <biases offset="6912" size="256"/>
        </layer>
        <layer name="relu1_1" type="ReLU" precision="FP32" id="2">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="3">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>184</dim>
                    <dim>184</dim>
                </port>
            </input>
            <output>
                <port id="4">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>184</dim>
                    <dim>184</dim>
                </port>
            </output>
        </layer>
        <layer name="conv1_2" type="Convolution" precision="FP32" id="3">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="64" group="1"/>
            <input>
                <port id="5">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>184</dim>
                    <dim>184</dim>
                </port>
            </input>
            <output>
                <port id="6">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>184</dim>
                    <dim>184</dim>
                </port>
            </output>
            <weights offset="7168" size="147456"/>
            <biases offset="154624" size="256"/>
        </layer>
        <layer name="relu1_2" type="ReLU" precision="FP32" id="4">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="7">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>184</dim>
                    <dim>184</dim>
                </port>
            </input>
            <output>
                <port id="8">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>184</dim>
                    <dim>184</dim>
                </port>
            </output>
        </layer>
        <layer name="pool1_stage1" type="Pooling" precision="FP32" id="5">
            <pooling_data kernel-x="2" kernel-y="2" pad-x="0" pad-y="0" stride-x="2" stride-y="2" rounding-type="ceil" pool-method="max"/>
            <input>
                <port id="9">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>184</dim>
                    <dim>184</dim>
                </port>
            </input>
            <output>
                <port id="10">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>92</dim>
                    <dim>92</dim>
                </port>
            </output>
        </layer>
        <layer name="conv2_1" type="Convolution" precision="FP32" id="6">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="11">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>92</dim>
                    <dim>92</dim>
                </port>
            </input>
            <output>
                <port id="12">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>92</dim>
                    <dim>92</dim>
                </port>
            </output>
            <weights offset="154880" size="294912"/>
            <biases offset="449792" size="512"/>
        </layer>
        <layer name="relu2_1" type="ReLU" precision="FP32" id="7">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="13">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>92</dim>
                    <dim>92</dim>
                </port>
            </input>
            <output>
                <port id="14">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>92</dim>
                    <dim>92</dim>
                </port>
            </output>
        </layer>
        <layer name="conv2_2" type="Convolution" precision="FP32" id="8">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="15">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>92</dim>
                    <dim>92</dim>
                </port>
            </input>
            <output>
                <port id="16">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>92</dim>
                    <dim>92</dim>
                </port>
            </output>
            <weights offset="450304" size="589824"/>
            <biases offset="1040128" size="512"/>
        </layer>
        <layer name="relu2_2" type="ReLU" precision="FP32" id="9">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="17">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>92</dim>
                    <dim>92</dim>
                </port>
            </input>
            <output>
                <port id="18">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>92</dim>
                    <dim>92</dim>
                </port>
            </output>
        </layer>
        <layer name="pool2_stage1" type="Pooling" precision="FP32" id="10">
            <pooling_data kernel-x="2" kernel-y="2" pad-x="0" pad-y="0" stride-x="2" stride-y="2" rounding-type="ceil" pool-method="max"/>
            <input>
                <port id="19">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>92</dim>
                    <dim>92</dim>
                </port>
            </input>
            <output>
                <port id="20">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>46</dim>
                    <dim>46</dim>
                </port>
            </output>
        </layer>
        <layer name="conv3_1" type="Convolution" precision="FP32" id="11">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="256" group="1"/>
            <input>
                <port id="21">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>46</dim>
                    <dim>46</dim>
                </port>
            </input>
            <output>
                <port id="22">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>46</dim>
                    <dim>46</dim>
                </port>
            </output>
            <weights offset="1040640" size="1179648"/>
            <biases offset="2220288" size="1024"/>
        </layer>
        <layer name="relu3_1" type="ReLU" precision="FP32" id="12">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="23">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>46</dim>
                    <dim>46</dim>
                </port>
            </input>
            <output>
                <port id="24">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>46</dim>
                    <dim>46</dim>
                </port>
            </output>
        </layer>
        <layer name="conv3_2" type="Convolution" precision="FP32" id="13">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="256" group="1"/>
            <input>
                <port id="25">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>46</dim>
                    <dim>46</dim>
                </port>
            </input>
            <output>
                <port id="26">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>46</dim>
                    <dim>46</dim>
                </port>
            </output>
            <weights offset="2221312" size="2359296"/>
            <biases offset="4580608" size="1024"/>
        </layer>
        <layer name="relu3_2" type="ReLU" precision="FP32" id="14">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="27">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>46</dim>
                    <dim>46</dim>
                </port>
            </input>
            <output>
                <port id="28">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>46</dim>
                    <dim>46</dim>
                </port>
            </output>
        </layer>
        <layer name="conv3_3" type="Convolution" precision="FP32" id="15">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="256" group="1"/>
            <input>
                <port id="29">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>46</dim>
                    <dim>46</dim>
                </port>
            </input>
            <output>
                <port id="30">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>46</dim>
                    <dim>46</dim>
                </port>
            </output>
            <weights offset="4581632" size="2359296"/>
            <biases offset="6940928" size="1024"/>
        </layer>
        <layer name="relu3_3" type="ReLU" precision="FP32" id="16">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="31">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>46</dim>
                    <dim>46</dim>
                </port>
            </input>
            <output>
                <port id="32">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>46</dim>
                    <dim>46</dim>
                </port>
            </output>
        </layer>
        <layer name="conv3_4" type="Convolution" precision="FP32" id="17">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="256" group="1"/>
            <input>
                <port id="33">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>46</dim>
                    <dim>46</dim>
                </port>
            </input>
            <output>
                <port id="34">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>46</dim>
                    <dim>46</dim>
                </port>
            </output>
            <weights offset="6941952" size="2359296"/>
            <biases offset="9301248" size="1024"/>
        </layer>
        <layer name="relu3_4" type="ReLU" precision="FP32" id="18">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="35">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>46</dim>
                    <dim>46</dim>
                </port>
            </input>
            <output>
                <port id="36">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>46</dim>
                    <dim>46</dim>
                </port>
            </output>
        </layer>
        <layer name="pool3_stage1" type="Pooling" precision="FP32" id="19">
            <pooling_data kernel-x="2" kernel-y="2" pad-x="0" pad-y="0" stride-x="2" stride-y="2" rounding-type="ceil" pool-method="max"/>
            <input>
                <port id="37">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>46</dim>
                    <dim>46</dim>
                </port>
            </input>
            <output>
                <port id="38">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="conv4_1" type="Convolution" precision="FP32" id="20">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="512" group="1"/>
            <input>
                <port id="39">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="40">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="9302272" size="4718592"/>
            <biases offset="14020864" size="2048"/>
        </layer>
        <layer name="relu4_1" type="ReLU" precision="FP32" id="21">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="41">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="42">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="conv4_2" type="Convolution" precision="FP32" id="22">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="512" group="1"/>
            <input>
                <port id="43">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="44">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="14022912" size="9437184"/>
            <biases offset="23460096" size="2048"/>
        </layer>
        <layer name="relu4_2" type="ReLU" precision="FP32" id="23">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="45">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="46">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="conv4_3_CPM" type="Convolution" precision="FP32" id="24">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="256" group="1"/>
            <input>
                <port id="47">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="48">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="23462144" size="4718592"/>
            <biases offset="28180736" size="1024"/>
        </layer>
        <layer name="relu4_3_CPM" type="ReLU" precision="FP32" id="25">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="49">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="50">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="conv4_4_CPM" type="Convolution" precision="FP32" id="26">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="51">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="52">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="28181760" size="1179648"/>
            <biases offset="29361408" size="512"/>
        </layer>
        <layer name="relu4_4_CPM" type="ReLU" precision="FP32" id="27">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="53">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="54">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="conv5_1_CPM_L2" type="Convolution" precision="FP32" id="30">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="59">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="60">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="29361920" size="589824"/>
            <biases offset="29951744" size="512"/>
        </layer>
        <layer name="relu5_1_CPM_L2" type="ReLU" precision="FP32" id="31">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="61">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="62">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="conv5_2_CPM_L2" type="Convolution" precision="FP32" id="34">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="67">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="68">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="29952256" size="589824"/>
            <biases offset="30542080" size="512"/>
        </layer>
        <layer name="relu5_2_CPM_L2" type="ReLU" precision="FP32" id="35">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="69">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="70">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="conv5_3_CPM_L2" type="Convolution" precision="FP32" id="38">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="75">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="76">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="30542592" size="589824"/>
            <biases offset="31132416" size="512"/>
        </layer>
        <layer name="relu5_3_CPM_L2" type="ReLU" precision="FP32" id="39">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="77">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="78">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="conv5_4_CPM_L2" type="Convolution" precision="FP32" id="42">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="512" group="1"/>
            <input>
                <port id="83">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="84">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="31132928" size="262144"/>
            <biases offset="31395072" size="2048"/>
        </layer>
        <layer name="relu5_4_CPM_L2" type="ReLU" precision="FP32" id="43">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="85">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="86">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="conv5_5_CPM_L2" type="Convolution" precision="FP32" id="45">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="16" group="1"/>
            <input>
                <port id="89">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="90">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="31397120" size="32768"/>
            <biases offset="31429888" size="64"/>
        </layer>
        <layer name="conv5_1_CPM_L1" type="Convolution" precision="FP32" id="28">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="55">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="56">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="31429952" size="589824"/>
            <biases offset="32019776" size="512"/>
        </layer>
        <layer name="relu5_1_CPM_L1" type="ReLU" precision="FP32" id="29">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="57">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="58">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="conv5_2_CPM_L1" type="Convolution" precision="FP32" id="32">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="63">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="64">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="32020288" size="589824"/>
            <biases offset="32610112" size="512"/>
        </layer>
        <layer name="relu5_2_CPM_L1" type="ReLU" precision="FP32" id="33">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="65">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="66">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="conv5_3_CPM_L1" type="Convolution" precision="FP32" id="36">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="71">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="72">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="32610624" size="589824"/>
            <biases offset="33200448" size="512"/>
        </layer>
        <layer name="relu5_3_CPM_L1" type="ReLU" precision="FP32" id="37">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="73">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="74">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="conv5_4_CPM_L1" type="Convolution" precision="FP32" id="40">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="512" group="1"/>
            <input>
                <port id="79">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="80">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="33200960" size="262144"/>
            <biases offset="33463104" size="2048"/>
        </layer>
        <layer name="relu5_4_CPM_L1" type="ReLU" precision="FP32" id="41">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="81">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="82">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="conv5_5_CPM_L1" type="Convolution" precision="FP32" id="44">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="28" group="1"/>
            <input>
                <port id="87">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="88">
                    <dim>1</dim>
                    <dim>28</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="33465152" size="57344"/>
            <biases offset="33522496" size="112"/>
        </layer>
        <layer name="concat_stage2" type="Concat" precision="FP32" id="46">
            <concat_data axis="1"/>
            <input>
                <port id="91">
                    <dim>1</dim>
                    <dim>28</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
                <port id="92">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
                <port id="93">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="94">
                    <dim>1</dim>
                    <dim>172</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="Mconv1_stage2_L2" type="Convolution" precision="FP32" id="49">
            <convolution_data stride-x="1" stride-y="1" pad-x="3" pad-y="3" kernel-x="7" kernel-y="7" output="128" group="1"/>
            <input>
                <port id="99">
                    <dim>1</dim>
                    <dim>172</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="100">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="33522608" size="4315136"/>
            <biases offset="37837744" size="512"/>
        </layer>
        <layer name="Mrelu1_stage2_L2" type="ReLU" precision="FP32" id="50">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="101">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="102">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="Mconv2_stage2_L2" type="Convolution" precision="FP32" id="53">
            <convolution_data stride-x="1" stride-y="1" pad-x="3" pad-y="3" kernel-x="7" kernel-y="7" output="128" group="1"/>
            <input>
                <port id="107">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="108">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="37838256" size="3211264"/>
            <biases offset="41049520" size="512"/>
        </layer>
        <layer name="Mrelu2_stage2_L2" type="ReLU" precision="FP32" id="54">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="109">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="110">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="Mconv3_stage2_L2" type="Convolution" precision="FP32" id="57">
            <convolution_data stride-x="1" stride-y="1" pad-x="3" pad-y="3" kernel-x="7" kernel-y="7" output="128" group="1"/>
            <input>
                <port id="115">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="116">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="41050032" size="3211264"/>
            <biases offset="44261296" size="512"/>
        </layer>
        <layer name="Mrelu3_stage2_L2" type="ReLU" precision="FP32" id="58">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="117">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="118">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="Mconv4_stage2_L2" type="Convolution" precision="FP32" id="61">
            <convolution_data stride-x="1" stride-y="1" pad-x="3" pad-y="3" kernel-x="7" kernel-y="7" output="128" group="1"/>
            <input>
                <port id="123">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="124">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="44261808" size="3211264"/>
            <biases offset="47473072" size="512"/>
        </layer>
        <layer name="Mrelu4_stage2_L2" type="ReLU" precision="FP32" id="62">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="125">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="126">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="Mconv5_stage2_L2" type="Convolution" precision="FP32" id="65">
            <convolution_data stride-x="1" stride-y="1" pad-x="3" pad-y="3" kernel-x="7" kernel-y="7" output="128" group="1"/>
            <input>
                <port id="131">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="132">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="47473584" size="3211264"/>
            <biases offset="50684848" size="512"/>
        </layer>
        <layer name="Mrelu5_stage2_L2" type="ReLU" precision="FP32" id="66">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="133">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="134">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="Mconv6_stage2_L2" type="Convolution" precision="FP32" id="69">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1"/>
            <input>
                <port id="139">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="140">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="50685360" size="65536"/>
            <biases offset="50750896" size="512"/>
        </layer>
        <layer name="Mrelu6_stage2_L2" type="ReLU" precision="FP32" id="70">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="141">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="142">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="Mconv7_stage2_L2" type="Convolution" precision="FP32" id="72">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="16" group="1"/>
            <input>
                <port id="145">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="146">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="50751408" size="8192"/>
            <biases offset="50759600" size="64"/>
        </layer>
        <layer name="Mconv1_stage2_L1" type="Convolution" precision="FP32" id="47">
            <convolution_data stride-x="1" stride-y="1" pad-x="3" pad-y="3" kernel-x="7" kernel-y="7" output="128" group="1"/>
            <input>
                <port id="95">
                    <dim>1</dim>
                    <dim>172</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="96">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="50759664" size="4315136"/>
            <biases offset="55074800" size="512"/>
        </layer>
        <layer name="Mrelu1_stage2_L1" type="ReLU" precision="FP32" id="48">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="97">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="98">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="Mconv2_stage2_L1" type="Convolution" precision="FP32" id="51">
            <convolution_data stride-x="1" stride-y="1" pad-x="3" pad-y="3" kernel-x="7" kernel-y="7" output="128" group="1"/>
            <input>
                <port id="103">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="104">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="55075312" size="3211264"/>
            <biases offset="58286576" size="512"/>
        </layer>
        <layer name="Mrelu2_stage2_L1" type="ReLU" precision="FP32" id="52">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="105">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="106">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="Mconv3_stage2_L1" type="Convolution" precision="FP32" id="55">
            <convolution_data stride-x="1" stride-y="1" pad-x="3" pad-y="3" kernel-x="7" kernel-y="7" output="128" group="1"/>
            <input>
                <port id="111">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="112">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="58287088" size="3211264"/>
            <biases offset="61498352" size="512"/>
        </layer>
        <layer name="Mrelu3_stage2_L1" type="ReLU" precision="FP32" id="56">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="113">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="114">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="Mconv4_stage2_L1" type="Convolution" precision="FP32" id="59">
            <convolution_data stride-x="1" stride-y="1" pad-x="3" pad-y="3" kernel-x="7" kernel-y="7" output="128" group="1"/>
            <input>
                <port id="119">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="120">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="61498864" size="3211264"/>
            <biases offset="64710128" size="512"/>
        </layer>
        <layer name="Mrelu4_stage2_L1" type="ReLU" precision="FP32" id="60">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="121">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="122">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
        </layer>
        <layer name="Mconv5_stage2_L1" type="Convolution" precision="FP32" id="63">
            <convolution_data stride-x="1" stride-y="1" pad-x="3" pad-y="3" kernel-x="7" kernel-y="7" output="128" group="1"/>
            <input>
                <port id="127">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </input>
            <output>
                <port id="128">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>23</dim>
                    <dim>23</dim>
                </port>
            </output>
            <weights offset="64710640" size="3211264"/>
            <biases offset="67921904" size="512"/>
        </layer>
        <layer name="Mrelu5_stage2_L1" type="ReLU" precision="FP32" id="64">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="129">
                    <dim>1</dim>
                    <dim>128</dim>
